xdu-aero-association/FM33LC0XX_Example_0.04/IWDT 示例/Drivers/FM33LC0xx_LL_Driver/Src/fm33lc0xx_ll_atim.c
#define IS_LL_ATIM_ETP_FILTER(__VALUE__)           (((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV1) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV1_N2) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV1_N4) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV1_N8) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV2_N6) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV2_N8) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV4_N6) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV4_N8) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV8_N6) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV8_N8) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV16_N5) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV16_N6) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV16_N8) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV32_N5) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV32_N6) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_FILTER_FDIV32_N8))


#define IS_LL_ATIM_ETR_PSC(__VALUE__)               (((__VALUE__) == LL_ATIM_ETR_PRESCALER_DIV1) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_PRESCALER_DIV2) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_PRESCALER_DIV4) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_PRESCALER_DIV8))
                                 
                                 

#define IS_LL_ATIM_ETR_POLARITY(__VALUE__)         (((__VALUE__) == LL_ATIM_ETR_POLARITY_NONINVERTED) \
                                                     || ((__VALUE__) == LL_ATIM_ETR_POLARITY_NINVERTED)) 

                                   
                                                    
#define IS_LL_ATIM_IC_POLARITY(__VALUE__)          (((__VALUE__) == LL_ATIM_IC_POLARITY_RISING) \
                                                       || ((__VALUE__) == LL_ATIM_IC_POLARITY_FALLING))



#define IS_LL_ATIM_IC_ACTIVEINPUT(__VALUE__)          (((__VALUE__) == LL_ATIM_CC1_MODE_INPUT_TI1) \
                                                       || ((__VALUE__) == LL_ATIM_CC1_MODE_INPUT_TI2) \
                                                       || ((__VALUE__) == LL_ATIM_CC2_MODE_INPUT_TI2) \
                                                       || ((__VALUE__) == LL_ATIM_CC2_MODE_INPUT_TI1) \
                                                       || ((__VALUE__) == LL_ATIM_CC3_MODE_INPUT_TI3) \
                                                       || ((__VALUE__) == LL_ATIM_CC3_MODE_INPUT_TI4) \
                                                       || ((__VALUE__) == LL_ATIM_CC4_MODE_INPUT_TI3) \
                                                       || ((__VALUE__) == LL_ATIM_CC4_MODE_INPUT_TI4) \
                                                       || ((__VALUE__) == LL_ATIM_CC_MODE_INPUT_TRC))
                                       
 
#define IS_LL_ATIM_IC_PRESCALER(__VALUE__)         (((__VALUE__) == LL_ATIM_IC_PRESCALER_DIV_1) \
                                                     || ((__VALUE__) == LL_ATIM_IC_PRESCALER_DIV_2) \
                                                     || ((__VALUE__) == LL_ATIM_IC_PRESCALER_DIV_4) \
                                                     || ((__VALUE__) == LL_ATIM_IC_PRESCALER_DIV_8))



#define IS_LL_ATIM_OC_POLARITY(__VALUE__)          (((__VALUE__) == LL_ATIM_OC_POLARITY_HIGH) \
                                                    || ((__VALUE__) == LL_ATIM_OC_POLARITY_LOW))



#define IS_LL_ATIM_OC_MODE(__VALUE__)               (((__VALUE__) ==   LL_ATIM_OC_MODE_FROZEN) \
                                                      || ((__VALUE__) == LL_ATIM_OC_MODE_ACTIVE) \
                                                      || ((__VALUE__) == LL_ATIM_OC_MODE_INACTIVE) \
                                                      || ((__VALUE__) == LL_ATIM_OC_MODE_TOGGLE) \
                                                      || ((__VALUE__) == LL_ATIM_OC_MODE_FORCED_INACTIVE) \
                                                      || ((__VALUE__) == LL_ATIM_OC_MODE_FORCED_ACTIVE) \
                                                      || ((__VALUE__) == LL_ATIM_OC_MODE_PWM1) \
                                                      || ((__VALUE__) == LL_ATIM_OC_MODE_PWM2))

#define IS_LL_ATIM_AUTORELOAB_STATE(__VALUE__)          (((__VALUE__) == ENABLE) \
                                                    || ((__VALUE__) == DISABLE))
                                                    
#define IS_LL_ATIM_OC_FASTMODE(__VALUE__)          (((__VALUE__) == ENABLE) \
                                                    || ((__VALUE__) == DISABLE))

#define IS_LL_ATIM_OC_PRELOAD(__VALUE__)          (((__VALUE__) == ENABLE) \
                                                    || ((__VALUE__) == DISABLE))
                                                    
#define IS_LL_ATIM_OC_ETR_CLEARN(__VALUE__)        (((__VALUE__) == ENABLE) \
                                                    || ((__VALUE__) == DISABLE))

#define IS_LL_ATIM_OCN_STATE(__VALUE__)          (((__VALUE__) == ENABLE)\
                                                    || ((__VALUE__) == DISABLE))

#define IS_LL_ATIM_OC_IDLESTATE(__VALUE__)          (((__VALUE__) == LL_ATIM_OC_IDLESTATE_LOW) \
                                                    || ((__VALUE__) == LL_ATIM_OC_IDLESTATE_HIGH))
                                                    
