xdu-aero-association/FM33LC0XX_Example_0.04/IWDT 示例/Drivers/FM33LC0xx_LL_Driver/Src/fm33lc0xx_ll_atim.c
#define IS_LL_ATIM_OC_NIDLESTATE(__VALUE__)        (((__VALUE__) == LL_ATIM_OCN_IDLESTATE_LOW) \
                                                    || ((__VALUE__) == LL_ATIM_OCN_IDLESTATE_HIGH))


#define IS_LL_ATIM_OC_NPOLARITY(__VALUE__)        (((__VALUE__) == LL_ATIM_OCN_POLARITY_HIGH) \
                                                    || ((__VALUE__) == LL_ATIM_OCN_POLARITY_LOW))


 
#define IS_LL_ATIM_BDTR_FILTER(__VALUE__)           (((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV1) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV1_N2) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV1_N4) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV1_N8) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV2_N6) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV2_N8) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV4_N6) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV4_N8) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV8_N6) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV8_N8) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV16_N5) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV16_N6) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV16_N8) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV32_N5) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV32_N6) \
                                                     || ((__VALUE__) == LL_ATIM_BRK_FILTER_FDIV32_N8))

#define IS_LL_ATIM_OSSR_STATE(__VALUE__) (((__VALUE__) == LL_ATIM_OSSR_DISABLE) \
                                     || ((__VALUE__) == LL_ATIM_OSSR_ENABLE))

#define IS_LL_ATIM_OSSI_STATE(__VALUE__) (((__VALUE__) == LL_ATIM_OSSI_DISABLE) \
                                      || ((__VALUE__) == LL_ATIM_OSSI_ENABLE))

#define IS_LL_ATIM_LOCK_LEVEL(__VALUE__) (((__VALUE__) == LL_ATIM_LOCKLEVEL_OFF) \
                                      || ((__VALUE__) == LL_ATIM_LOCKLEVEL_1)   \
                                      || ((__VALUE__) == LL_ATIM_LOCKLEVEL_2)   \
                                      || ((__VALUE__) == LL_ATIM_LOCKLEVEL_3))

#define IS_LL_ATIM_BREAK_POLARITY(__VALUE__) (((__VALUE__) == LL_ATIM_BREAK_POLARITY_LOW) \
                                          || ((__VALUE__) == LL_ATIM_BREAK_POLARITY_HIGH))

#define IS_LL_ATIM_AUTOMATIC_OUTPUT_STATE(__VALUE__)    (((__VALUE__) == DISABLE) \
                                                        || ((__VALUE__) == ENABLE))

#define IS_LL_ATIM_TRIGGER_DELAY(__VALUE__)              (((__VALUE__) == DISABLE) \
                                                        || ((__VALUE__) == ENABLE))

#define IS_LL_ATIM_IC_CAPTURE_STATE(__VALUE__)           (((__VALUE__) == DISABLE) \
                                                        || ((__VALUE__) == ENABLE))








/**
  * @}
  */


/* Private function prototypes -----------------------------------------------*/
/** @defgroup TIM_LL_Private_Functions TIM Private Functions
  * @{
  */
static ErrorStatus  OCConfig(ATIM_Type *TIMx, uint32_t Channel, LL_ATIM_OC_InitTypeDef* TIM_OC_InitStruct );
/**
  * @}
  */

/** @addtogroup TIM_LL_EF_Init
  * @{
  */

/**
  * @brief  复位对应ATIMx寄存器.
  * @param  ATIMx 
  * @retval ErrorStatus枚举值:
  *       	-PASS 外设寄存器值恢复复位值
  *       	-FAIL 未成功执行
  */
ErrorStatus LL_ATIM_DeInit(ATIM_Type *TIMx)
{
    ErrorStatus result = PASS;

    /* Check the parameters */
    assert_param(IS_ATIM_INSTANCE(TIMx));
    /* 使能外设复位 */
    LL_RCC_EnablePeripheralReset();
    /* 使能外设复位 */
    LL_RCC_EnableResetAPB2Peripheral(LL_RCC_APB2_PERIPHERAL_RST_ATIM);
    LL_RCC_DisableResetAPB2Peripheral(LL_RCC_APB2_PERIPHERAL_RST_ATIM);
    /* 关闭外设时钟 */
    LL_RCC_Group4_DisableBusClock(LL_RCC_BUS4_CLOCK_ATIM);
    LL_RCC_Group1_DisableOperationClock(LL_RCC_OPERATION1_CLOCK_ATIM);
    /* 锁定外设复位 */
    LL_RCC_DisablePeripheralReset();
    return result;
}
/**
  * @brief  配置基本定时器时基单元（内部时钟源）.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref LL_ATIM_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值	
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus LL_ATIM_Init(ATIM_Type *TIMx, LL_ATIM_InitTypeDef *TIM_InitStruct)
{

    /* 参数检查 */
    assert_param(IS_ATIM_INSTANCE(TIMx));
    assert_param(IS_LL_ATIM_COUNTERMODE(TIM_InitStruct->CounterMode));
    assert_param(IS_LL_ATIM_CLOCKDIVISION(TIM_InitStruct->ClockDivision));
    assert_param(IS_LL_ATIM_AUTORELOAB_STATE(TIM_InitStruct->AutoreloadState));
    assert_param(IS_ATIM_CLKSRC(TIM_InitStruct->ClockSource));
    
    /* 时钟总线使能配置 */ 
    LL_RCC_SetATIMClockSource(TIM_InitStruct->ClockSource);
    LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_ATIM);
    LL_RCC_Group1_EnableOperationClock(LL_RCC_OPERATION1_CLOCK_ATIM);
    /* 设置重复计数值 */
    LL_ATIM_SetConfigRepeatCnt(TIMx, TIM_InitStruct->RepetitionCounter);
    /* 计数器计数模式配置 */
    switch(TIM_InitStruct->CounterMode)
    {
        /* 中心对称模式 */
        case LL_ATIM_COUNTER_ALIGNED_CENTER_DOWN   :   
        case LL_ATIM_COUNTER_ALIGNED_CENTER_UP     : 
        case LL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN:
        LL_ATIM_SetCounterAlignedMode(TIMx,TIM_InitStruct->CounterMode);
        break;
        default:
        /* 边沿模式 */
        LL_ATIM_SetCounterDirection(TIMx,TIM_InitStruct->CounterMode);
        LL_ATIM_SetCounterAlignedMode(TIMx,LL_ATIM_COUNTER_ALIGNED_EDGE);
        break;
    }
    /* 自动重装载值 */
    LL_ATIM_SetAutoReload(TIMx,TIM_InitStruct->Autoreload );
    /* 定时器分频系数与数字滤波器所使用的采样时钟分频比 */
    LL_ATIM_SetClockDivision(TIMx,TIM_InitStruct->ClockDivision);
    /* 时钟分频 */
    LL_ATIM_SetPrescaler(TIMx,TIM_InitStruct->Prescaler);
    /* 预装载配置 */
    if(TIM_InitStruct->AutoreloadState == ENABLE)
    {
        LL_ATIM_EnableARRPreload(TIMx);
    }
    else
    {
        LL_ATIM_DisableARRPreload(TIMx);
    }
    /* 手动触发更新事件，将配置值写入 */
    LL_ATIM_GenerateEvent_UPDATE(TIMx);
    
