xdu-aero-association/FM33LC0XX_Example_0.04/IWDT 示例/Drivers/FM33LC0xx_LL_Driver/Src/fm33lc0xx_ll_atim.c
    return PASS;
}

/**
  * @brief	设置 LL_ATIM_InitTypeDef 为默认配置
  * @param 	TIM_InitStruct 指向需要将值设置为默认配置的结构体 @ref LL_ATIM_InitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_ATIM_StructInit(LL_ATIM_InitTypeDef *TIM_InitStruct)
{
  /* Set the default configuration */
  TIM_InitStruct->ClockSource           = LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_APBCLK2;
  TIM_InitStruct->Prescaler             = (uint16_t)0x0000;
  TIM_InitStruct->CounterMode           = LL_ATIM_COUNTER_DIRECT_UP;
  TIM_InitStruct->Autoreload            = 0xFFFFU;
  TIM_InitStruct->ClockDivision         = LL_ATIM_CLOCKDIVISION_DIV1;
  TIM_InitStruct->RepetitionCounter     = 0;
  TIM_InitStruct->AutoreloadState       = DISABLE;
}

/**
  * @brief  配置基本定时器从模式，包括编码器模式.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref LL_ATIM_SlaveInitTypeDef 结构体 
  * @retval ErrorStatus枚举值	
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */ 
ErrorStatus LL_ATIM_SlaveMode_Init(ATIM_Type *TIMx, LL_ATIM_SlaveInitTypeDef *TIM_InitStruct)
{

    /* 参数检查 */
    assert_param(IS_ATIM_INSTANCE(TIMx)); 
    assert_param(IS_LL_ATIM_TRIGGER_DELAY(TIM_InitStruct->TriggerDelay));
    assert_param(IS_LL_ATIM_TRIGGER_SRC(TIM_InitStruct->TriggerSrc));
    /* 时钟总线使能配置 */
    LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_ATIM);
    LL_RCC_Group1_EnableOperationClock(LL_RCC_OPERATION1_CLOCK_ATIM);
    /* 触发延迟默认关闭 */
    LL_ATIM_DisableMasterSlaveMode(TIMx);
    /* 关闭从模式以能写入TS */  
    LL_ATIM_SetSlaveMode(TIMx,0);
    /* 从模式输入源选择 */
    LL_ATIM_SetTriggerInput(TIMx,TIM_InitStruct->TriggerSrc);
    /* 从模式选择 */
    LL_ATIM_SetSlaveMode(TIMx,TIM_InitStruct->SlaveMode);
    /* 触发延迟默认关闭 */
    if(TIM_InitStruct->TriggerDelay == ENABLE)
    {
        LL_ATIM_EnableMasterSlaveMode(TIMx);
    }
    /* 手动触发更新事件，将配置值写入 */
    LL_ATIM_GenerateEvent_UPDATE(TIMx);
    
    return PASS;
}
/**
  * @brief	设置 LL_ATIM_SlaveInitTypeDef 为默认配置
  * @param 	TIM_InitStruct 指向需要将值设置为默认配置的结构体 @ref LL_ATIM_SlaveInitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_ATIM_SlaveModeStructInit(LL_ATIM_SlaveInitTypeDef *TIM_InitStruct)
{
      
    TIM_InitStruct->SlaveMode     = LL_ATIM_SLAVE_MODE_PROHIBITED;     
    TIM_InitStruct->TriggerSrc    = LL_ATIM_TIM_TS_TI1FP1;
    TIM_InitStruct->TriggerDelay  = DISABLE;

}

/**
  * @brief  配置TIM的输入捕获通道.
  * @param  TIMx Timer Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ATIM_CHANNEL_0
  *         @arg @ref LL_ATIM_CHANNEL_1
  *         @arg @ref LL_ATIM_CHANNEL_2
  *         @arg @ref LL_ATIM_CHANNEL_3
  * @param  TIM_IC_InitStruct 指向一个 @ref LL_ATIM_IC_InitTypeDef 结构体
  * @retval  TIM_OC_InitStruct pointer to a @ref LL_ATIM_OC_InitTypeDef structure 
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus  LL_ATIM_IC_Init(ATIM_Type *TIMx,uint32_t Channel,LL_ATIM_IC_InitTypeDef* IC_InitStruct)
{
    /* 参数检查 */
    assert_param(IS_LL_ATIM_CHANNEL(Channel));
    assert_param(IS_LL_ATIM_IC_CAPTURE_STATE(IC_InitStruct->CaptureState));
    assert_param(IS_LL_ATIM_IC_POLARITY(IC_InitStruct->ICPolarity));
    assert_param(IS_LL_ATIM_IC_ACTIVEINPUT(IC_InitStruct->ICActiveInput));                             
    assert_param(IS_LL_ATIM_IC_PRESCALER(IC_InitStruct->ICPrescaler));
    assert_param(IS_LL_ATIM_IC_FILTER(IC_InitStruct->ICFilter));
    /* 时钟总线使能配置 */
    LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_ATIM);
    LL_RCC_Group1_EnableOperationClock(LL_RCC_OPERATION1_CLOCK_ATIM);  
    /* 通道关闭 */
    LL_ATIM_DisableNormalChannelOutput(TIMx,Channel);
    /*捕获极性 */
    LL_ATIM_SetICPolartyChannel(TIMx,IC_InitStruct->ICPolarity,Channel);
    /* 捕获映射通道 */
    LL_ATIM_SetChannelMode(TIMx,IC_InitStruct->ICActiveInput,Channel);
    /* 捕获预分频 */
    LL_ATIM_SetICModePrescaler(TIMx,IC_InitStruct->ICPrescaler,Channel);
    /* 捕获滤波器 */
    LL_ATIM_SetICModeFilter(TIMx,IC_InitStruct->ICFilter,Channel);
    if(IC_InitStruct->CaptureState == ENABLE)
    {
        LL_ATIM_EnableChannelCapture(TIMx,Channel);
    }
    /* 手动触发更新事件，将配置值写入 */
    LL_ATIM_GenerateEvent_UPDATE(TIMx);
    return PASS;
}
/**
  * @brief	设置 LL_ATIM_IC_InitTypeDef 为默认配置
  * @param 	TIM_ICInitStruct 指向需要将值设置为默认配置的结构体 @ref LL_ATIM_IC_InitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_ATIM_IC_StructInit(LL_ATIM_IC_InitTypeDef *TIM_ICInitStruct)
{
  /* 默认配置 */  
  TIM_ICInitStruct->ICPolarity    = LL_ATIM_IC_POLARITY_RISING;
  TIM_ICInitStruct->ICActiveInput = LL_ATIM_CC1_MODE_INPUT_TI1;
  TIM_ICInitStruct->ICPrescaler   = LL_ATIM_IC_PRESCALER_DIV_1;
  TIM_ICInitStruct->ICFilter      = LL_ATIM_IC_FILTER_FDIV1;
  TIM_ICInitStruct->CaptureState  = DISABLE;
}
/**
  * @brief  配置TIM触发输入捕获通道ETR.
  * @param  TIMx Timer Instance
  * @param  ETPolarity   极性
  * @param  ETPrescaler  分频
  * @param  ETR_Filter   滤波
  * @param  TIM_IC_InitStruct 指向一个 @ref LL_ATIM_IC_InitTypeDef 结构体
  * @retval  TIM_OC_InitStruct pointer to a @ref LL_ATIM_OC_InitTypeDef structure 
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus  LL_ATIM_ETR_Init(ATIM_Type *TIMx, LL_ATIM_ETR_InitTypeDef* TIM_InitStruct)
{
  
    assert_param(IS_LL_ATIM_ETP_FILTER(TIM_InitStruct->ETRFilter));
    assert_param(IS_LL_ATIM_ETR_PSC(TIM_InitStruct->ETRClockDivision));                                                      
    assert_param(IS_LL_ATIM_ETR_POLARITY(TIM_InitStruct->ETRPolarity));
                                          
    /* 时钟总线使能配置 */
    LL_RCC_Group4_EnableBusClock(LL_RCC_BUS4_CLOCK_ATIM);
    LL_RCC_Group1_EnableOperationClock(LL_RCC_OPERATION1_CLOCK_ATIM);
    /* 外部时钟极性 */
    LL_ATIM_SetETRPolarity(TIMx,TIM_InitStruct->ETRPolarity);
    /* 外部时钟滤波 */
    LL_ATIM_SetETRExtrenalTriggerFilter(TIMx,TIM_InitStruct->ETRFilter);
    /* 外部时钟分频 */
    LL_ATIM_SetETRExtrenalTriggerPsc(TIMx,TIM_InitStruct->ETRClockDivision);
    if(TIM_InitStruct->AsExternal == ENABLE)
    {
        LL_ATIM_EnableExternalClock(TIMx);
    }
    else
    {
        LL_ATIM_DisableExternalClock(TIMx);
    }
    /* 手动触发更新事件，将配置值写入 */
    LL_ATIM_GenerateEvent_UPDATE(TIMx);
    return PASS;
}

void LL_ATIM_ETRStructInit(LL_ATIM_ETR_InitTypeDef *TIM_InitStruct)
{
    TIM_InitStruct->AsExternal          = DISABLE;
    TIM_InitStruct->ETRFilter           = LL_ATIM_ETR_FILTER_FDIV1;       
    TIM_InitStruct->ETRPolarity         = LL_ATIM_ETR_POLARITY_NONINVERTED;     
    TIM_InitStruct->ETRClockDivision    = LL_ATIM_ETR_PRESCALER_DIV1;
}
/**
  * @brief  配置TIM的比较输出通道.
  * @param  TIMx Timer Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ATIM_CHANNEL_1
  *         @arg @ref LL_ATIM_CHANNEL_2
  *         @arg @ref LL_ATIM_CHANNEL_3
  *         @arg @ref LL_ATIM_CHANNEL_4
  * @retval TIM_OC_InitStruct pointer to a @ref LL_ATIM_OC_InitTypeDef structure 
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus LL_ATIM_OC_Init(ATIM_Type *TIMx, uint32_t Channel, LL_ATIM_OC_InitTypeDef *TIM_OC_InitStruct)
{
    ErrorStatus result = PASS;
    /* 参数检查 */
    assert_param(IS_ATIM_INSTANCE(TIMx)); 
    assert_param(IS_LL_ATIM_OC_MODE(TIM_OC_InitStruct->OCMode));
    assert_param(IS_LL_ATIM_OC_PRELOAD(TIM_OC_InitStruct->OCPreload));
    assert_param(IS_LL_ATIM_OC_POLARITY(TIM_OC_InitStruct->OCPolarity));
    assert_param(IS_LL_ATIM_OC_FASTMODE(TIM_OC_InitStruct->OCFastMode));
    assert_param(IS_LL_ATIM_OC_ETR_CLEARN(TIM_OC_InitStruct->OCETRFStatus));
    assert_param(IS_LL_ATIM_OCN_STATE(TIM_OC_InitStruct->OCNState)); 
    assert_param(IS_LL_ATIM_OC_IDLESTATE(TIM_OC_InitStruct->OCIdleState));
    assert_param(IS_LL_ATIM_OC_NIDLESTATE(TIM_OC_InitStruct->OCNIdleState));
    assert_param(IS_LL_ATIM_OC_NPOLARITY(TIM_OC_InitStruct->OCNPolarity));

    /* 通道关闭 */
    LL_ATIM_DisableNormalChannelOutput(TIMx,Channel);
    LL_ATIM_DisableReverseChannelOutPut(TIMx,Channel);
	
    /* 通道极性 */
    LL_ATIM_SetOCPolartyNormalChannel(TIMx,TIM_OC_InitStruct->OCPolarity,Channel);
    /* 通道空闲电平 */
    LL_ATIM_Set_OC_SetIdleState(TIMx,TIM_OC_InitStruct->OCIdleState,Channel);
    /* 互补通道空闲电平 */
    LL_ATIM_Set_OCN_SetIdleState(TIMx,TIM_OC_InitStruct->OCNIdleState,Channel); 
    /* 互补通道极性 */
    LL_ATIM_SetOCPolartyReverseChannel(TIMx,TIM_OC_InitStruct->OCNPolarity,Channel);
    /* 捕获映射到输出通道 */
    LL_ATIM_SetChannelMode(TIMx,LL_ATIM_CC_MODE_OUTPUT,Channel);
    /* 输出比较模式寄存器配置 */
    OCConfig(TIMx,Channel,TIM_OC_InitStruct);
    /* 通道使能 */
    LL_ATIM_EnableNormalChannelOutput(TIMx,Channel);
    /* 手动触发更新事件，将配置值写入 */
    LL_ATIM_GenerateEvent_UPDATE(TIMx);
    
    return result;
}
/**
  * @brief	设置 LL_ATIM_OC_InitTypeDef 为默认配置
  * @param 	TIM_OC_InitStruct 指向需要将值设置为默认配置的结构体 @ref LL_ATIM_OC_InitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_ATIM_OC_StructInit(LL_ATIM_OC_InitTypeDef *TIM_OC_InitStruct)
{
  /* Set the default configuration */
  TIM_OC_InitStruct->OCMode       = LL_ATIM_OC_MODE_FROZEN;
  TIM_OC_InitStruct->OCETRFStatus = DISABLE;
  TIM_OC_InitStruct->OCFastMode   = DISABLE;
  TIM_OC_InitStruct->CompareValue = 0x00000000U;
  TIM_OC_InitStruct->OCPolarity   = LL_ATIM_OC_POLARITY_HIGH;
  TIM_OC_InitStruct->OCPreload    = DISABLE;
  TIM_OC_InitStruct->OCIdleState  = LL_ATIM_OC_IDLESTATE_LOW;
  TIM_OC_InitStruct->OCNIdleState = LL_ATIM_OCN_IDLESTATE_LOW;
  TIM_OC_InitStruct->OCNPolarity  = LL_ATIM_OCN_POLARITY_HIGH;
  TIM_OC_InitStruct->OCNState     = DISABLE;
}
/**
  * @brief	配置
  * @param  TIMx Timer Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_ATIM_CHANNEL_1
  *         @arg @ref LL_ATIM_CHANNEL_2
  *         @arg @ref LL_ATIM_CHANNEL_3
  *         @arg @ref LL_ATIM_CHANNEL_4
  * @param 	TIM_ICInitStruct 指向需要将值设置为默认配置的结构体 @ref LL_ATIM_IC_InitTypeDef 结构体包含配置参数.
  * @retval	None
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
static ErrorStatus OCConfig(ATIM_Type *TIMx, uint32_t Channel,LL_ATIM_OC_InitTypeDef *TIM_OC_InitStruct)
{
    ErrorStatus result = PASS;
    
    /* 配置比较输出通道模式 */
    LL_ATIM_SetOCMode(TIMx,TIM_OC_InitStruct->OCMode,Channel);
    /* 配置TRF清零使能 */
    if(TIM_OC_InitStruct->OCETRFStatus == ENABLE)
    {
        LL_ATIM_Enable_Clear(TIMx,Channel);
    }
    else
    {
        LL_ATIM_Disable_Clear(TIMx,Channel);
    }
    /* 比较输出通道快速模式 */
    if(TIM_OC_InitStruct->OCFastMode == ENABLE )
    {
        LL_ATIM_Enable_FastCompare(TIMx,Channel);
    }
    else
    {
        LL_ATIM_Disable_FastCompare(TIMx,Channel);
    }
    /* 比较输出通道缓冲模式 */
    if(TIM_OC_InitStruct->OCPreload == ENABLE)
    {
        LL_ATIM_Enable_Preload(TIMx,Channel);
    }
    else
    {
        LL_ATIM_Disable_Preload(TIMx,Channel);
    }
    if(TIM_OC_InitStruct->OCNState == ENABLE)
    {
        LL_ATIM_EnableReverseChannelOutPut(TIMx,Channel);
    }
    /* 设置比较值 */
    switch(Channel)
    {
        case LL_ATIM_CHANNEL_1:
            LL_ATIM_SetCompareCH1(TIMx,TIM_OC_InitStruct->CompareValue);
            break;
        case LL_ATIM_CHANNEL_2:
            LL_ATIM_SetCompareCH2(TIMx,TIM_OC_InitStruct->CompareValue);
            break;
        case LL_ATIM_CHANNEL_3:
            LL_ATIM_SetCompareCH3(TIMx,TIM_OC_InitStruct->CompareValue);
            break;
        case LL_ATIM_CHANNEL_4:
            LL_ATIM_SetCompareCH4(TIMx,TIM_OC_InitStruct->CompareValue);
            break;
        default :
            result = FAIL;
            break;

