xdu-aero-association/FM33LC0XX_Example_0.04/IWDT 示例/Drivers/FM33LC0xx_LL_Driver/Src/fm33lc0xx_ll_atim.c
    }
    return result;
}
/**
  * @brief  配置TIM的输入捕获通道.
  * @param  TIMx Timer Instance
  * @param  TIM_IC_InitStruct 指向一个 @ref LL_ATIM_IC_InitTypeDef 结构体
  * @retval  TIM_OC_InitStruct pointer to a @ref LL_ATIM_OC_InitTypeDef structure 
  *			-FAIL 配置过程发生错误        
  *			-PASS 成功  
  */
ErrorStatus LL_ATIM_BDTR_Init(ATIM_Type *TIMx, LL_ATIM_BDTR_InitTypeDef *TIM_BDTR_InitStruct)
{
    ErrorStatus result = PASS;
    /* 参数检查 */
    assert_param(IS_ATIM_INSTANCE(TIMx));
    assert_param(IS_LL_ATIM_OSSR_STATE(TIM_BDTR_InitStruct->OSSRState));
    assert_param(IS_LL_ATIM_OSSI_STATE(TIM_BDTR_InitStruct->OSSIState));
    assert_param(IS_LL_ATIM_LOCK_LEVEL(TIM_BDTR_InitStruct->LockLevel));
    assert_param(IS_LL_ATIM_BREAK_POLARITY(TIM_BDTR_InitStruct->BreakPolarity));
    assert_param(IS_LL_ATIM_AUTOMATIC_OUTPUT_STATE(TIM_BDTR_InitStruct->AutomaticOutput));
    assert_param(IS_LL_ATIM_BDTR_FILTER(TIM_BDTR_InitStruct->BreakFilter));
    /* 关闭所有输出 */
    LL_ATIM_Disable_AllOutputs(TIMx);
    /* 设置死区时间 */
    LL_ATIM_SetDeadTimeGeneration(TIMx,TIM_BDTR_InitStruct->DeadTime);
    /* 设置寄存器锁定等级 */
    LL_ATIM_SetLockLevel(TIMx,TIM_BDTR_InitStruct->LockLevel);
    /* Idle状态下关闭状态 */
    LL_ATIM_SetOffStates_Idel(TIMx,TIM_BDTR_InitStruct->OSSIState);
    /* run状态下关闭状态 */
    LL_ATIM_SetOffStates_Run(TIMx,TIM_BDTR_InitStruct->OSSRState);
    /* 门控1刹车信号 */
    LL_ATIM_SetBreak1GateState(TIMx,TIM_BDTR_InitStruct->GatedBrakeSignal_1);
    /* 门控2刹车信号 */
    LL_ATIM_SetBreak2GateState(TIMx,TIM_BDTR_InitStruct->GatedBrakeSignal_2);
    /* 门控刹车信号组合方式设置  */
    LL_ATIM_SetBreakSignalCombination(TIMx,TIM_BDTR_InitStruct->BrakeSignalCombined);
    /* 刹车极性设置 */
    LL_ATIM_SetBreakPolarity(TIMx,TIM_BDTR_InitStruct->BreakPolarity);
    /* 更新时间自动设置输出配置，如果刹车事件发生过并且当前功能使能，则下一个更新事件将重新自动输出 */
    
    if(TIM_BDTR_InitStruct->AutomaticOutput == ENABLE)
    {
        LL_ATIM_Enable_AutomaticOutput(TIMx);
    }
    else
    {
        LL_ATIM_Disable_AutomaticOutput(TIMx);
    }
    /* 刹车功能开关配置 */
    if(TIM_BDTR_InitStruct->BreakState == ENABLE)
    {
        LL_ATIM_Enable_BRK(TIMx);
    }
    else
    {
        LL_ATIM_Disable_BRK(TIMx);
    }
    /* 使能全部输出 */
    LL_ATIM_Enable_AllOutputs(TIMx);
    /* 手动触发更新事件，将配置值写入 */
    LL_ATIM_GenerateEvent_UPDATE(TIMx);
    /* 手动触发更新事件，将配置值写入 */
    LL_ATIM_GenerateEvent_COM(TIMx);
    return result;
}
/**
  * @brief	设置 LL_ATIM_IC_InitTypeDef 为默认配置
  * @param 	TIM_ICInitStruct 指向需要将值设置为默认配置的结构体 @ref LL_ATIM_IC_InitTypeDef 结构体  
  *         
  * @retval	None
  */
void LL_ATIM_BDTR_StructInit(LL_ATIM_BDTR_InitTypeDef *TIM_BDTR_InitStruct)
{ 
    TIM_BDTR_InitStruct->DeadTime            = 0x00;
    TIM_BDTR_InitStruct->LockLevel           = LL_ATIM_LOCKLEVEL_OFF;
    TIM_BDTR_InitStruct->OSSRState           = LL_ATIM_OSSR_DISABLE;
    TIM_BDTR_InitStruct->OSSIState           = LL_ATIM_OSSI_DISABLE;
    TIM_BDTR_InitStruct->BreakFilter         = LL_ATIM_BRK_FILTER_FDIV1;
    TIM_BDTR_InitStruct->BreakPolarity       = LL_ATIM_BREAK_POLARITY_LOW; 
    TIM_BDTR_InitStruct->AutomaticOutput     = DISABLE;
    TIM_BDTR_InitStruct->GatedBrakeSignal_1  = LL_ATIM_BREAK1_GATE_AUTO;
    TIM_BDTR_InitStruct->GatedBrakeSignal_2  = LL_ATIM_BREAK2_GATE_AUTO;
    TIM_BDTR_InitStruct->BreakState          = DISABLE;
    TIM_BDTR_InitStruct->BrakeSignalCombined = LL_ATIM_BRK_COMBINATION_OR;
}

/**
  * @}
  */
  
/**
  * @}
  */
/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-10-24**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
